src/Catalogs/ИТСервисы_Проекты/ИТСервисы_Проекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИТСервисы_Проекты</name>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПространствоKaiten</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.ИТСервисы_СтатусыПроектов</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ИТСервис</name>
    <type>
      <types>CatalogRef.ИТСервисы_ИТСервисы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПартнерыИКонтактныеЛица</name>
    <attributes>
      <name>Партнер</name>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>РольПартнера</name>
      <type>
        <types>CatalogRef.РолиПартнеровВСделкахИПроектах</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтактноеЛицо</name>
      <type>
        <types>CatalogRef.КонтактныеЛицаПартнеров</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТребованияККоманде</name>
    <attributes>
      <name>Роль</name>
      <type>
        <types>CatalogRef.ИТСервисы_РолиВКомандах</types>
      </type>
    </attributes>
    <attributes>
      <name>ТребуемыйГрейд</name>
      <type>
        <types>EnumRef.ИТСервисы_Грейды</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбязательнаяКомпетенция</name>
      <type>
        <types>CatalogRef.ИТСервисы_Компетенции</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Enums/ИТСервисы_СтатусыПроектов/ИТСервисы_СтатусыПроектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ИТСервисы_СтатусыПроектов</name>
  <enumValues>
    <name>Планируется</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Завершен</name>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/ИТСервисы_Проекты/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПлановаяДатаНачалаПриИзменении(Элемент)
	ПроверитьКорректностьДат();
	ОбновитьСтатусПоДатам();
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	ОбновитьСтатусПоДатам();
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	ПроверитьКорректностьДат();
	ОбновитьСтатусПоДатам();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьСтатусПоДатам()
	Если Объект.Статус = Перечисления.ИТСервисы_СтатусыПроектов.Отменен Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
		Объект.Статус = Перечисления.ИТСервисы_СтатусыПроектов.Завершен;
	ИначеЕсли ЗначениеЗаполнено(Объект.ДатаНачала) Тогда
		Объект.Статус = Перечисления.ИТСервисы_СтатусыПроектов.ВРаботе;
	ИначеЕсли ЗначениеЗаполнено(Объект.ПлановаяДатаНачала) Тогда
		Объект.Статус = Перечисления.ИТСервисы_СтатусыПроектов.Планируется;
	Иначе
		Объект.Статус = Неопределено;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьКорректностьДат()
	Если ЗначениеЗаполнено(Объект.ПлановаяДатаНачала) И ЗначениеЗаполнено(Объект.ПлановаяДатаОкончания) Тогда
		Если Объект.ПлановаяДатаНачала > Объект.ПлановаяДатаОкончания Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата начала плана больше даты окончания!", , "Объект.ПлановаяДатаНачала");
		КонецЕсли;
	КонецЕсли;

	Если ЗначениеЗаполнено(Объект.ДатаНачала) И ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
		Если Объект.ДатаНачала > Объект.ДатаОкончания Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Фактическая дата начала больше даты окончания!", , "Объект.ДатаНачала");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
